<img src='https://docs.google.com/drawings/d/e/2PACX-1vQCLdzfcNWNyQa8poL9IszNfgvM8VB93eblATcEjTgrc6MJTFTncZKsUJ5LmU_GxFgmpOsPYxEzEJGj/pub?w=960&h=720'>

# ***A Quick Introduction To Pandas***
#### A DataFrame, reminiscent of a spreadsheet, is the primary object in Pandas. Data is organized into tables with columns and rows, that can be manipulated similar to a spreadsheet. Depending on your notebook, you may need to install Pandas before importing it.

#### The example code cell below uses a <font color='green'>try</font> and <font color='green'>except</font> code block to import Pandas and assigns<br> it the common alias <font color='green'>pd</font>.$^{1}$

---
##### $^{1}$ For a discussion of  <font color='green'>try</font> and <font color='green'>exceot</font> code block see the Chapter *Control Statements*.

In [1]:
try:
  import pandas as pd
except:
  !pip install pandas
  import pandas as pd

## ***Creating Or Instantiating A DataFrame***

### ***A Bare Bones DataFrame***
#### The first Pandas method demonstrated is <font color='green'>DataFrame()</font>.  The required arguments of the method are<br> the data that must be an iterable: e.g. a list or a dictionary.$^{2}$  Here the DataFrame <font color='green'>df_bare_bones</font> is <br>created with two simple lists: <font color='green'>x</font> and <font color='green'>y</font>.
---
##### $^{2}$ If you need a little help with this concept check out Chapter *A First Look At Lists*.

In [2]:
x=[1,2,3]
y=[4,5,6]
df_bare_bones=pd.DataFrame([x,y])
df_bare_bones

   0  1  2
0  1  2  3
1  4  5  6

### ***Adding Labels For Columns And Rows***
#### <font color='green'>df_bare_bones</font> is a table, but it's not very useful.  The first improvement is to provide labels for the<br> columns and the rows.  Both are attributes of <font color='green'>df_bare_bones</font> and the values have been<br> assigned by Pandas.  The column attribute is referred to as <font color='green'>columns</font> and the row attribute<br> as <font color='green'>index</font>. As with all objects, these attributes can be accessed using a dot after the<br> object's name. In this case, the <font color='green'>columns</font> attribute is assigned the list <font color='green'>['First', 'Second', 'Third']</font>,<br> and the <font color='green'>rows</font> attribute is assigned the list <font color='green'>['x', 'y']</font>.

In [3]:
df_bare_bones.columns=['First','Second','Third']
df_bare_bones.index=['x','y']
df_bare_bones

   First  Second  Third
x      1       2      3
y      4       5      6

### ***Including The Labels As Arguments Of DataFrame()***
#### As an alternative the label values can  be assigned to <font color='green'>columns</font> and <font color='green'>index</font> as arguments of the method. Because the attributes are not variables of the notebook, the names assigned may be the same as the attributes.

In [4]:
columns=['First','Second','Third']
index=['x','y']
df_bare_bones=pd.DataFrame([x,y],columns=columns,index=index)
df_bare_bones

   First  Second  Third
x      1       2      3
y      4       5      6

### ***Iterating Through The Columns And Index***
#### The values of rows and columns can be accessed by iterating through a DataFrame's <font color='green'>columns</font><br> or <font color='green'>index</font>.  Here the values of the labels of <font color='green'>columns</font> and <font color='green'>index</font> are printed.

In [5]:
for column in df_bare_bones.columns:
  print(column)
for index in df_bare_bones.index:
  print(index)

First
Second
Third
x
y

### ***The loc and iloc Attributes***
#### A row of A DataFrame is identified with the <font color='green'>loc</font> or <font color='green'>iloc</font> attribute.  The <font color='green'>loc</font> attribute uses<br> the value of the <font color='green'>index</font>; in our example 'x' or 'y'.  The <font color='green'>iloc</font> attribute uses the location of the row<br> in the <font color='green'>index</font>; in our example, 0 or 1.

#### In the next code cell the values of 'First' column are printed by iterating through the index with loc.

#### ***loc Attribute***

In [6]:
for index in df_bare_bones.index:
  print(df_bare_bones.loc[index]['First'])

1
4

#### ***iloc Attribute***

#### The <font color='green'>iloc</font> example uses the <font color='green'>index</font> values of 0 and 1 to print the value of 'Second' column.<br>  The <font color='green'>iloc</font> attribute requires the <font color='green'>enumerate</font> function of Python that keeps track of the number<br> of iterations.$^{3}$  The row is then fixed with <font color='green'>loc</font> and the columns are iterated through to show all<br> the values of the list <font color='green'>x</font>.

---
##### $^{3.}$ [Gemini](https://www.google.com/search?q=enumerate+python&sca_esv=4c9a68065c6f5352&sxsrf=AHTn8zpFQrffBo7A1DtDquPAIbCumB4tUQ%3A1742055832997&ei=mKnVZ9bRPKvJwN4P857-qAo&oq=enumerate+fpython&gs_lp=Egxnd3Mtd2l6LXNlcnAiEWVudW1lcmF0ZSBmcHl0aG9uKgIIATIGEAAYBxgeMgoQABiABBixAxgNMgYQABgHGB4yBhAAGAcYHjIGEAAYBxgeMgYQABgHGB4yBhAAGAcYHjIHEAAYgAQYDTIHEAAYgAQYDTIGEAAYBxgeSO1BUKguWKgucAN4AZABAJgBXKABXKoBATG4AQHIAQD4AQGYAgSgAoIBwgIKEAAYsAMY1gQYR8ICDRAAGIAEGLADGEMYigXCAhMQLhiABBiwAxjRAxhDGMcBGIoFmAMAiAYBkAYKkgcDMy4xoAfuBg&sclient=gws-wiz-serp) provides a nice explanation of the <font color='green'>enumerate</font> function.

In [7]:
for row,index in enumerate(df_bare_bones.index):
  print(df_bare_bones.iloc[row]['Second'])

2
5

### ***Locate A Row With An Index Value***
#### The <font color='green'>get_indexer()</font> method locates the row number of the <font color='green'>index</font> from a value.  If the label is not present, minus one is returned. The value must be an iterable.  Here it is a list.

In [8]:
# the list ['x', 'z'] is used for get_indexer method.
# 'x' is identified as index 0, 'z' is not found and -1 is returned
index_values=df_bare_bones.index.get_indexer(['x','z'])
index_values

array([ 0, -1])

#### ***Fixing The Row With <font color='green'>loc</font> And Iterating Through The Columns.***

In [9]:
# the row is fixed as 'x'
for column in df_bare_bones.columns:
  print(df_bare_bones.loc['x'][column])

1
2
3

### ***Create A DataFrame From A Dictionary***
#### It's convenient to create a DataFrame from a dictionary.  Dictionaries are key-value pairs.$^{4}$<br> The keys are interpreted as column names, and the values are the data assigned to those columns.<br> In this example, the 'Value of x' and 'Value of y' columns are assigned the lists <font color='green'>x</font> and <font color='green'>y</font>, respectively.



---
#####  $^{4}$ For an introduction to dictionaries see Chapter *A Quick Introduction To Dictionaries*.

In [10]:
#Pandas method DataFrame() with the sole argument the dictionary data
data={'Values of x':[1,2,3],'Values of y':[4,5,6]}
df_dict=pd.DataFrame(data,index=columns)
df_dict

        Values of x  Values of y
First             1            4
Second            2            5
Third             3            6

### ***Add A Column***

#### ***Assign A List To The New Column 'Values of z'***

In [11]:
df_dict['Values of z']=[4.5,5.5,6.5]
df_dict

        Values of x  Values of y  Values of z
First             1            4          4.5
Second            2            5          5.5
Third             3            6          6.5

#### ***Assign Three Plus The Column 'Values of y' To The New Column 'Values of z'***

In [12]:
df_dict['Values of z']=df_dict['Values of y']+3
df_dict

        Values of x  Values of y  Values of z
First             1            4            7
Second            2            5            8
Third             3            6            9

### ***The Transpose***
#### Because the <font color='green'>DataFrame()</font> method interprets the dictionary keys as column names, <font color='green'>df_dict</font><br> is the transpose of <font color='green'>df_bare_bones</font>.  To that end, the index of <font color='green'>df_dict</font> is assigned the <font color='green'>columns</font><br> list that was assigned as the <font color='green'>columns</font> of <font color='green'>df_bare_bones</font>.  The Pandas method <font color='green'>transpose()</font><br> transposes a DataFrame but does not replace the values.  To keep the transposed <font color='green'>DataFrame</font><br> it must be assigned to another variable. The <font color='green'>transpose</font> method may also be accessed with a capital <font color='green'>T</font>.

##### ***Transpose With Method <font color='green'>transpose()</font>, <font color='green'>T</font> For Shorthand.***

In [13]:
#Use the full name of the method transpose()
df_dict.transpose()

             First  Second  Third
Values of x      1       2      3
Values of y      4       5      6
Values of z      7       8      9

In [14]:
#Use the short-hand .T and assign it to df_transpose
df_transpose=df_dict.T
df_transpose

             First  Second  Third
Values of x      1       2      3
Values of y      4       5      6
Values of z      7       8      9

## ***DataFrames, CSV, And Excel Files***

### ***Creating A DataFrame With A CSV File***
#### Colab notebooks contain sample data within the 'sample_data' folder. In this instance, the data from the csv file 'california_housing_train.csv' is transformed into a DataFrame using the Pandas <font color='green'>read_csv()</font> method. The file is downloaded from DropBox and the sole necessary argument is the path to the file.

#### The file is then assigned to <font color='green'>df_csv</font>, and the initial ten rows are displayed by slicing the <font color='green'>index</font><br> using the <font color='green'>iloc</font> attribute.

In [15]:
url='https://www.dropbox.com/scl/fi/8vr4pq42p99zxu5lc9qe6/\
california_housing_train.csv?rlkey=8foebx6137zspvq5d5rqd9f2f&st=01oy0yej&dl=1'
df_csv=pd.read_csv(url)
df_csv.iloc[:10]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-114.31,34.19,15.0,5612.0,1283.0,1015.0,472.0,1.4936,66900.0
1,-114.47,34.40,19.0,7650.0,1901.0,1129.0,463.0,1.8200,80100.0
2,-114.56,33.69,17.0,720.0,174.0,333.0,117.0,1.6509,85700.0
3,-114.57,33.64,14.0,1501.0,337.0,515.0,226.0,3.1917,73400.0
4,-114.57,33.57,20.0,1454.0,326.0,624.0,262.0,1.9250,65500.0
5,-114.58,33.63,29.0,1387.0,236.0,671.0,239.0,3.3438,74000.0
6,-114.58,33.61,25.0,2907.0,680.0,1841.0,633.0,2.6768,82400.0
7,-114.59,34.83,41.0,812.0,168.0,375.0,158.0,1.7083,48500.0
8,-114.59,33.61,34.0,4789.0,1175.0,3134.0,1056.0,2.1782,58400.0
9,-114.60,34.83,46.0,1497.0,309.0,787.0,271.0,2.1908,48100.0

In [16]:
df_csv.to_excel('sample.xlsx',sheet_name='First Sheet',index=False)

In [17]:
url='sample.xlsx'
df_excel=pd.read_excel(url,sheet_name='First Sheet')
df_excel[:10]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-114.31,34.19,15,5612,1283,1015,472,1.4936,66900
1,-114.47,34.40,19,7650,1901,1129,463,1.8200,80100
2,-114.56,33.69,17,720,174,333,117,1.6509,85700
3,-114.57,33.64,14,1501,337,515,226,3.1917,73400
4,-114.57,33.57,20,1454,326,624,262,1.9250,65500
5,-114.58,33.63,29,1387,236,671,239,3.3438,74000
6,-114.58,33.61,25,2907,680,1841,633,2.6768,82400
7,-114.59,34.83,41,812,168,375,158,1.7083,48500
8,-114.59,33.61,34,4789,1175,3134,1056,2.1782,58400
9,-114.60,34.83,46,1497,309,787,271,2.1908,48100

### ***Making A Column The Index***
#### The <font color='green'>set_index()</font> method makes a column an index. One of the arguments of the method<br> is <font color='green'>inplace</font> that defaults to False.  If assigned True, the DataFrame is permanently changed.<br>  Here it is assigned to a new DataFrame.

In [18]:
df_excel_new_index=df_excel.set_index('longitude')
df_excel_new_index

,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
longitude,,,,,,,,
-114.31,34.19,15,5612,1283,1015,472,1.4936,66900
-114.47,34.40,19,7650,1901,1129,463,1.8200,80100
-114.56,33.69,17,720,174,333,117,1.6509,85700
-114.57,33.64,14,1501,337,515,226,3.1917,73400
-114.57,33.57,20,1454,326,624,262,1.9250,65500
...,...,...,...,...,...,...,...,...
-124.26,40.58,52,2217,394,907,369,2.3571,111400
-124.27,40.69,36,2349,528,1194,465,2.5179,79000
-124.30,41.84,17,2677,531,1244,456,3.0313,103600
-124.30,41.80,19,2672,552,1298,478,1.9797,85800
-124.35,40.54,52,1820,300,806,270,3.0147,94600

## ***Pandas To Numpy***
#### The method <font color='green'>to_numpy()</font> converts a DataFrame to a NumPy array. All values of the DataFrame are converted to a single type.  Unlike DataFrames, NumPy arrays are not indexed. The value for the -114.56 latitude is accessed with the <font color='green'>iloc</font> attribute.

In [19]:
excel_numpy=df_excel_new_index.to_numpy()
loc=df_excel_new_index.index.get_loc(-114.56)
excel_numpy[loc]

array([3.3690e+01, 1.7000e+01, 7.2000e+02, 1.7400e+02, 3.3300e+02,
       1.1700e+02, 1.6509e+00, 8.5700e+04])

## ***The apply() Method***
#### The <font color='green'>apply()</font> function in Pandas is a versatile method used to apply a function along an axis of a DataFrame or to the values of a Series. It enables element-wise, row-wise, or column-wise operations using custom or built-in functions avoiding iterating through rows or columns.

#### The <font color='green'>average_bedrooms()</font> function calculates the average number of bedrooms from the total number of bedrooms and households.

```
def average_bedrooms(total_num_bedrooms,total_num_households):
  avg_bedrooms=total_num_bedrooms/total_num_households
  return avg_bedrooms
```
#### <font color='green'>average_bedrooms()</font> is applied to each longitude (row) of the DataFrame <font color='green'>df_excel_new</font>. Using the anonymous lambda function allows the assignment of values in each row as arguments of the function.$^{5}$

```
df_excel_new_index['Average Bedrooms'] = df_excel_new_index.apply(
    lambda row: average_bedrooms(
        total_num_bedrooms=row['total_bedrooms'],  # 'total_bedrooms' accessed from the row
        total_num_households=row['households']   # Access the 'households' value from the row
         ), axis=1)                            #axis=1 indicates columns
df_excel_new_index
```

#### In this example, the <font color='green'>apply()</font> method has the same effects as direct operation on the columns.



```
df_excel_new_index['Average Bedrooms']=df_exce_new_index['total_bedrooms']/df_excel_new_index['households']
```



---
##### $^{5}$ For a discussion of lambda functions see *A Quick Look At Functions*.

In [20]:
def average_bedrooms(total_num_bedrooms,total_num_households):
  avg_bedrooms=total_num_bedrooms/total_num_households
  return avg_bedrooms

In [21]:
df_excel_new_index['Average Bedrooms'] = df_excel_new_index.apply(
    lambda row: average_bedrooms(
        total_num_bedrooms=row['total_bedrooms'],  # 'total_bedrooms' value accessed from the row
        total_num_households=row['households']   # Access the 'households' value from the row
         ), axis=1)
df_excel_new_index

,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,Average Bedrooms
longitude,,,,,,,,,
-114.31,34.19,15,5612,1283,1015,472,1.4936,66900,2.718220
-114.47,34.40,19,7650,1901,1129,463,1.8200,80100,4.105832
-114.56,33.69,17,720,174,333,117,1.6509,85700,1.487179
-114.57,33.64,14,1501,337,515,226,3.1917,73400,1.491150
-114.57,33.57,20,1454,326,624,262,1.9250,65500,1.244275
...,...,...,...,...,...,...,...,...,...
-124.26,40.58,52,2217,394,907,369,2.3571,111400,1.067751
-124.27,40.69,36,2349,528,1194,465,2.5179,79000,1.135484
-124.30,41.84,17,2677,531,1244,456,3.0313,103600,1.164474
-124.30,41.80,19,2672,552,1298,478,1.9797,85800,1.154812
-124.35,40.54,52,1820,300,806,270,3.0147,94600,1.111111

## ***The iterrows() Method***
#### The <font color='green'>iterrows()</font> method of Pandas iterates over the rows of a DataFrame and returns a tuple of the row's values.  The example:

```
longitude_latitude=[(longitude,row['latitude']) for longitude,row in df_excel_new_index.iloc[:5].iterrows()]
display(longitude_latitude)
```
#### Displays the longitude and the latitude of the first five rows as a list of tuples.  The index is assigned to longitude and latitudge to the 'latitude' column of <font color='green'>df_excel_new_index</font>.  The list <font color='green'>longitude_latitude</font> is created with list comprehension of the two values.

In [22]:
longitude_latitude=[(longitude,row['latitude']) for longitude,row in df_excel_new_index.iloc[:5].iterrows()]
display(longitude_latitude)

[(-114.31, 34.19),
 (-114.47, 34.4),
 (-114.56, 33.69),
 (-114.57, 33.64),
 (-114.57, 33.57)]

## ***Pandas To Timestamp() Method***
#### The Pandas <font color='green'>Timestamp()</font> is the Pandas equivalent of <font color='green'>datetime</font> and includes some useful attributes.  The example converts a <font color='green'>datetime</font> to a <font color='green'>Timestamp</font> and printing both values and several attributes of Pandas <font color='green'>Timestamp()</font>.$^{6}$


---
##### $^{6}$ For introduction to the datetime module see Chapter *A Quick Introduction To Manipulating Dates*.

In [23]:
from datetime import datetime
date_time=datetime(2025,1,21)
pandas_time_stamp=pd.Timestamp(date_time)
pandas_time_stamp,date_time,pandas_time_stamp.day_of_week,pandas_time_stamp.is_month_end

(Timestamp('2025-01-21 00:00:00'),
 datetime.datetime(2025, 1, 21, 0, 0),
 1,
 False)

## ***Pandas duplicated() Method***
#### Duplicated rows of a DataFrame or values of a Series can be determined with the <font color='green'>duplicated()</font> method.  By default the first occurrence of a duplicated value is marked as False and all others are marked as True.  Here the method is applied to the index of the first ten rows of <font color='green'>df_excel_new_index</font>.

In [24]:
display(df_excel_new_index.iloc[0:10].index.duplicated())
display(df_excel_new_index.iloc[0:10].index)

array([False, False, False, False,  True, False,  True, False,  True,
       False])

Float64Index([-114.31, -114.47, -114.56, -114.57, -114.57, -114.58, -114.58,
              -114.59, -114.59,  -114.6],
             dtype='float64', name='longitude')

## ***Negate A Pandas Value With ~***
#### If you want to only keep unique values, it makes sense to negate the values returned from <font color='green'>duplicated()</font>.

In [25]:
first_occurence=(~df_excel_new_index.iloc[0:10].index.duplicated())
display(df_excel_new_index.iloc[0:10].index[first_occurence])

Float64Index([-114.31, -114.47, -114.56, -114.57, -114.58, -114.59, -114.6], dtype='float64', name='longitude')